Revit 2027 API
StructuralSection.ShearAreaWeakAxis Property
 Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ShearAreaWeakAxis { get; set; }
Public Property ShearAreaWeakAxis As Double
	Get
	Set
public:
property double ShearAreaWeakAxis {
	double get ();
	void set (double value);
}
member ShearAreaWeakAxis : float with get, set
Property Value
Double
See Also
Reference
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace